//#Использовать cmdline
#Использовать fs

Процедура ВывестиПростыеЧисла(Аргументы) Экспорт
массив = Новый Массив();
Для каждого текАргументы Из Аргументы Цикл
	Сообщить(текАргументы);
	массив.Добавить(текАргументы);
КонецЦикла;

Для Индекс=2 По массив.Количество()-1 Цикл
	Если массив[Индекс]%2<>0 Тогда
		Сообщить("Число простое " + массив[Индекс]);
	КонецЕсли;
КонецЦикла;
//Парсер = Новый ПарсерАргументовКоманднойСтроки();
//Парсер.ДобавитьПараметр("ВвестиЧисло"); 
//Парсер.ДобавитьИменованныйПараметр("-action"); 
//Параметры = Парсер.Разобрать(АргументыКоманднойСтроки); 
//Сообщить(Параметры["ВвестиЧисло"]);
//Сообщить(Параметры["-action"]);
 
 
//Сообщить(массив[4]);


КонецПроцедуры

Аргументы=АргументыКоманднойСтроки;
ВывестиПростыеЧисла(Аргументы);
Сообщить(ФС.Существует("../temp.txt"));



