#Использовать gui
//#Использовать cmdline


&НаКлиенте

Процедура ПолучитьСлучЧисла()
массив = Новый Массив;
ГСЧ = Новый ГенераторСлучайныхЧисел;
СлучайноеЧисло = ГСЧ.СлучайноеЧисло(0,1000);
Для Счетчик=0 По 100 Цикл
  массив.добавить(СлучайноеЧисло);
КонецЦикла;
Для Каждого Элем Из массив Цикл
  Сообщить(Элем);
КонецЦикла;


Если массив.Количество()=0 Тогда
    Сообщить("Пустой массив");
КонецЕсли;

Для Каждого Элем Из массив Цикл
  МинимальныйЭлемент=массив[0];
  Если МинимальныйЭлемент < Элем Тогда
    МинимальныйЭлемент=Элем;
       КонецЕсли;
КонецЦикла;

Для Каждого Элем Из массив Цикл
  МаксимальныйЭлемент=массив[0];
  Если МаксимальныйЭлемент > Элем Тогда
    МаксимальныйЭлемент=Элем;
       КонецЕсли;
КонецЦикла;

Сумма=0;
Для Каждого Элем Из массив Цикл
 Сумма=Сумма + Элем;
КонецЦикла;

Для Каждого Элем Из массив Цикл
 Сумма=Сумма + Элем;
Количество=массив.Количество();
СреднееАрифмет=Сумма/Количество;
КонецЦикла;

массив1=Новый Массив;
массив1.добавить(8);
массив1.добавить(3);
массив1.добавить(2);
массив1.добавить(4);
массив1.добавить(7);
массив1.добавить(6);
массив1.добавить(5);
массив1.добавить(1);

Для просмотр = 0 По массив1.Количество()-1 Цикл
Для индекс = 0 По массив1.Количество()-1 Цикл

		Если индекс = массив1.Количество()-1 Тогда

				Прервать;

			КонецЕсли;

Если массив1[индекс] > массив[индекс + 1] Тогда

ЭлементЗамены = массив1[индекс];

массив1[индекс] = массив[индекс + 1];

массив[индекс + 1]=ЭлементЗамены;



КонецЕсли;
Сообщить(индекс);
КонецЦикла;
КонецЦикла;

Сообщить("Наименьший элемент массива: " + МинимальныйЭлемент);
Сообщить("Наибольший элемент массива: " + МаксимальныйЭлемент);  
Сообщить("Сумма элементов массива: " + Сумма);  
Сообщить("Среднее арифметическ элементов массива: " + СреднееАрифмет);  
Сообщить("Сортировка списком значений:" + СортировкаСпискомЗначений(массив1));

КонецПроцедуры



//Сортировка списком значений
Функция СортировкаСпискомЗначений(Знач Массив)


мСписокЗнч = Новый СписокЗначений;
мСписокЗнч.ЗагрузитьЗначения(Массив);
мСписокЗнч.СортироватьПоЗначению(НаправлениеСортировки.Возр);
Возврат мСписокЗнч.ВыгрузитьЗначения();

КонецФункции



функция ПолучитьФакториалЧисла()
ГСЧ = Новый ГенераторСлучайныхЧисел;
СлучайноеЧисло = ГСЧ.СлучайноеЧисло(1,15);
Сообщить("Случайн. числа: " + СлучайноеЧисло);
Факториал = 1;
Для Шаг=1 По СлучайноеЧисло Цикл
  
  Факториал=Факториал*Шаг;
  
КонецЦикла;

Возврат Факториал;

КонецФункции

Процедура ВывестиПростыеЧисла()
Перем Число,Форма;
Результат = ВвестиСтроку(Число);
Сообщить(Число(Результат));


//Парсер = Новый ПарсерАргументовКоманднойСтроки();
//Парсер.ДобавитьПараметр("Ввести число: "); 
//Парсер.ДобавитьИменованныйПараметр("-action"); 
//Параметры = Парсер.Разобрать(АргументыКоманднойСтроки); 
//Сообщить(Параметры["Ввести число: "]);
//Сообщить(Параметры["-action"]);
 
 //УправляемыйИнтерфейс = Новый УправляемыйИнтерфейс();
  //  Форма = УправляемыйИнтерфейс.СоздатьФорму();

    //# Устанавливаем обработку события ПриОткрытии
    //Форма.УстановитьДействие(ЭтотОбъект, "ПриОткрытии", "ПриОткрытииФормы");
   // Форма.Показать();

КонецПроцедуры



ПолучитьСлучЧисла();

массив1=Новый Массив;
массив1.добавить(8);
массив1.добавить(3);
массив1.добавить(2);
массив1.добавить(4);
массив1.добавить(7);
массив1.добавить(6);
массив1.добавить(5);
массив1.добавить(1);
результ=СортировкаСпискомЗначений(массив1);
Сообщить(результ[7]);

РезультатФакториал=ПолучитьФакториалЧисла();
Сообщить("Результат факториал: " + РезультатФакториал);

ВывестиПростыеЧисла();

